AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
/* ELRS include */

#include "rxtx_common.h"

// #include "CRSFHandset.h"
// #include "dynpower.h"
// #include "lua.h"
#include "msp.h"
#include "msptypes.h"
#include "telemetry_protocol.h"
#include "stubborn_receiver.h"
#include "stubborn_sender.h"

// #include "devHandset.h"
// #include "devLED.h"
// #include "devScreen.h"
// #include "devBuzzer.h"
// #include "devBLE.h"
// #include "devLUA.h"
// #include "devWIFI.h"
// #include "devButton.h"
// #include "devVTX.h"
// #include "devGsensor.h"
// #include "devThermal.h"
// #include "devPDET.h"
// #include "devBackpack.h"

// #include "MAVLink.h"

/* User include */

#include <Adafruit_SSD1306.h>
#include "TimerInterrupt_Generic.h"

/* ELRS variable */

// #define MSP_PACKET_SEND_INTERVAL 10LU

// MSP msp;
ELRS_EEPROM eeprom;

FIFO<AP_MAX_BUF_LEN> apInputBuffer;
FIFO<AP_MAX_BUF_LEN> apOutputBuffer;

// #define UART_INPUT_BUF_LEN 1024
// FIFO<UART_INPUT_BUF_LEN> uartInputBuffer;

// // Buffer for current stubbon sender packet (mavlink only)
// uint8_t mavlinkSSBuffer[CRSF_MAX_PACKET_LEN]; 

// bool NextPacketIsMspData = false;  

// #define syncSpamAmount 3
// #define syncSpamAmountAfterRateChange 10
// volatile uint8_t syncSpamCounter = 0;
// volatile uint8_t syncSpamCounterAfterRateChange = 0;
uint32_t rfModeLastChangedMS = 0;
uint32_t SyncPacketLastSent = 0;


volatile uint32_t LastTLMpacketRecvMillis = 0;
// uint32_t TLMpacketReported = 0;
// static bool commitInProgress = false;

LQCALC<25> LQCalc;

volatile bool busyTransmitting;
// static volatile bool ModelUpdatePending;

uint8_t MSPDataPackage[5];
#define BindingSpamAmount 25
static uint8_t BindingSendCount;
// bool RxWiFiReadyToSend = false;

// bool headTrackingEnabled = false;
// #if !defined(CRITICAL_FLASH)
// static uint16_t ptrChannelData[3] = {CRSF_CHANNEL_VALUE_MID, CRSF_CHANNEL_VALUE_MID, CRSF_CHANNEL_VALUE_MID};
// static uint32_t lastPTRValidTimeMs;
// #endif

static TxTlmRcvPhase_e TelemetryRcvPhase = ttrpTransmitting;
StubbornReceiver TelemetryReceiver;
StubbornSender MspSender;
// uint8_t CRSFinBuffer[CRSF_MAX_PACKET_LEN+1];

/* User variable */

#define OLED_RESET 4
#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
Adafruit_SSD1306 display(OLED_RESET);

#define AIRRATE RATE_LORA_333HZ_8CH
#define BUADRATE 14400
bool isAirPort = false;

uint16_t fullScount;
uint16_t fullSfreq;
uint16_t fullRcount;
uint16_t fullRfreq;
uint16_t validSendCount;
uint16_t validSendFreq;
uint16_t validReceiveCount;
uint16_t validReceiveFreq;

#define TIMER_INTERVAL_MS 100000
STM32Timer ITimer(TIM2);

uint8_t CRCvalue;

#define PACKETSIZE 255
uint8_t StubbornSenderBuffer[PACKETSIZE];
uint8_t StubbornReceiverBuffer[PACKETSIZE];

/* ELRS Function*/

// void ICACHE_RAM_ATTR LinkStatsFromOta(OTA_LinkStats_s * const ls) // ELRS移植，注释源码另起修改
// {
//   int8_t snrScaled = ls->SNR;
//   DynamicPower_TelemetryUpdate(snrScaled);

//   // Antenna is the high bit in the RSSI_1 value
//   // RSSI received is signed, inverted polarity (positive value = -dBm)
//   // OpenTX's value is signed and will display +dBm and -dBm properly
//   CRSF::LinkStatistics.uplink_RSSI_1 = -(ls->uplink_RSSI_1);
//   CRSF::LinkStatistics.uplink_RSSI_2 = -(ls->uplink_RSSI_2);
//   CRSF::LinkStatistics.uplink_Link_quality = ls->lq;
// #if defined(DEBUG_FREQ_CORRECTION)
//   // Don't descale the FreqCorrection value being send in SNR
//   CRSF::LinkStatistics.uplink_SNR = snrScaled;
// #else
//   CRSF::LinkStatistics.uplink_SNR = SNR_DESCALE(snrScaled);
// #endif
//   CRSF::LinkStatistics.active_antenna = ls->antenna;
//   connectionHasModelMatch = ls->modelMatch;
//   -- downlink_SNR / downlink_RSSI is updated for any packet received, not just Linkstats
//   -- uplink_TX_Power is updated when sending to the handset, so it updates when missing telemetry
//   -- rf_mode is updated when we change rates
//   -- downlink_Link_quality is updated before the LQ period is incremented
//   MspSender.ConfirmCurrentPayload(ls->mspConfirm);
// }

bool ICACHE_RAM_ATTR ProcessTLMpacket(SX12xxDriverCommon::rx_status const status) // ELRS移植，注释源码另起修改
{
  if (status != SX12xxDriverCommon::SX12XX_RX_OK)
  {
    // Serial.println("TLM HW CRC error");
    // DBGLN("TLM HW CRC error");
    return false;
  }

  OTA_Packet_s * const otaPktPtr = (OTA_Packet_s * const)Radio.RXdataBuffer;
  if (!OtaValidatePacketCrc(otaPktPtr))
  {    
    // Serial.println("TLM crc error");
    // DBGLN("TLM crc error");
    return false;
  }

  if (otaPktPtr->std.type != PACKET_TYPE_TLM)
  {    
    // Serial.println("TLM type error " + String(otaPktPtr->std.type));
    // DBGLN("TLM type error %d", otaPktPtr->std.type);
    return false;
  }

  LastTLMpacketRecvMillis = millis();
  LQCalc.add();
  //
  // Radio.GetLastPacketStats();
  // CRSF::LinkStatistics.downlink_SNR = SNR_DESCALE(Radio.LastPacketSNRRaw);
  // CRSF::LinkStatistics.downlink_RSSI_1 = Radio.LastPacketRSSI;
  // CRSF::LinkStatistics.downlink_RSSI_2 = Radio.LastPacketRSSI2;

  // Full res mode
  if (OtaIsFullRes)
  {
    OTA_Packet8_s * const ota8 = (OTA_Packet8_s * const)otaPktPtr;
    uint8_t *telemPtr;
    uint8_t dataLen;
    // if (ota8->tlm_dl.containsLinkStats)
    // {
    //   LinkStatsFromOta(&ota8->tlm_dl.ul_link_stats.stats);
    //   telemPtr = ota8->tlm_dl.ul_link_stats.payload;
    //   dataLen = sizeof(ota8->tlm_dl.ul_link_stats.payload);
    // }
    // else
    {
      if(isAirPort && otaPktPtr->full.airport.count)
      // if (firmwareOptions.is_airport)
      {
        validReceiveCount++;
        OtaUnpackAirportData(otaPktPtr, &apOutputBuffer);
        return true;
      }
      MspSender.ConfirmCurrentPayload(ota8->tlm_dl.containsLinkStats);
      telemPtr = ota8->tlm_dl.payload;
      dataLen = sizeof(ota8->tlm_dl.payload);
    }
    // //DBGLN("pi=%u len=%u", ota8->tlm_dl.packageIndex, dataLen);
    validReceiveCount++;
    TelemetryReceiver.ReceiveData(ota8->tlm_dl.packageIndex & ELRS8_TELEMETRY_MAX_PACKAGES, telemPtr, dataLen);
  }
  // // Std res mode
  // else
  // {
  //   switch (otaPktPtr->std.tlm_dl.type)
  //   {
  //     case ELRS_TELEMETRY_TYPE_LINK:
  //       LinkStatsFromOta(&otaPktPtr->std.tlm_dl.ul_link_stats.stats);
  //       break;

  //     case ELRS_TELEMETRY_TYPE_DATA:
  //       if(otaPktPtr->std.airport.count)
  //       // if (firmwareOptions.is_airport)
  //       {
  //         validReceiveCount++;
  //         OtaUnpackAirportData(otaPktPtr, &apOutputBuffer);
  //         return true;
  //       }
  //       // TelemetryReceiver.ReceiveData(otaPktPtr->std.tlm_dl.packageIndex & ELRS4_TELEMETRY_MAX_PACKAGES,
  //       //   otaPktPtr->std.tlm_dl.payload,
  //       //   sizeof(otaPktPtr->std.tlm_dl.payload));
  //       break;
  //   }
  // }

