AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
  return true;
}

void ICACHE_RAM_ATTR GenerateSyncPacketData(OTA_Sync_s * const syncPtr) // ELRS移植，注释源码另起修改
{
  // const uint8_t SwitchEncMode = config.GetSwitchMode();
  // const uint8_t Index = (syncSpamCounter) ? config.GetRate() : ExpressLRS_currAirRate_Modparams->index;

  // if (syncSpamCounter)
  //   --syncSpamCounter;

  // if (syncSpamCounterAfterRateChange && Index == ExpressLRS_currAirRate_Modparams->index)
  // {
  //   --syncSpamCounterAfterRateChange;
  //   if (connectionState == connected) // We are connected again after a rate change.  No need to keep spaming sync.
  //     syncSpamCounterAfterRateChange = 0;
  // }

  SyncPacketLastSent = millis();

  // expresslrs_tlm_ratio_e newTlmRatio = UpdateTlmRatioEffective();

  syncPtr->fhssIndex = FHSSgetCurrIndex();
  syncPtr->nonce = OtaNonce;
  // syncPtr->rateIndex = Index;
  // syncPtr->newTlmRatio = newTlmRatio - TLM_RATIO_NO_TLM;
  // syncPtr->switchEncMode = SwitchEncMode;
  syncPtr->UID3 = UID[3];
  syncPtr->UID4 = UID[4];
  syncPtr->UID5 = UID[5];

  // // For model match, the last byte of the binding ID is XORed with the inverse of the modelId
  // if (!InBindingMode && config.GetModelMatch())
  // {
  //   syncPtr->UID5 ^= (~CRSFHandset::getModelID()) & MODELMATCH_MASK;
  // }
}

void SetRFLinkRate(uint8_t index) // ELRS移植，注释源码另起修改
{
    expresslrs_mod_settings_s *const ModParams = get_elrs_airRateConfig(index);
    expresslrs_rf_pref_params_s *const RFperf = get_elrs_RFperfParams(index);
    // Binding always uses invertIQ
    bool invertIQ = InBindingMode || (UID[5] & 0x01);
    // OtaSwitchMode_e newSwitchMode = (OtaSwitchMode_e)config.GetSwitchMode();

  if ((ModParams == ExpressLRS_currAirRate_Modparams)
    && (RFperf == ExpressLRS_currAirRate_RFperfParams)
    && (invertIQ == Radio.IQinverted)
    // && (OtaSwitchModeCurrent == newSwitchMode)
    )
    return;
    Serial.println("set rate " + String(index));
    // DBGLN("set rate %u", index);
    uint32_t interval = ModParams->interval;
#if defined(DEBUG_FREQ_CORRECTION) && defined(RADIO_SX128X)
  interval = interval * 12 / 10; // increase the packet interval by 20% to allow adding packet header
#endif
  hwTimer::updateInterval(interval);

    FHSSusePrimaryFreqBand = !(ModParams->radio_type == RADIO_TYPE_LR1121_LORA_2G4) && !(ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_2G4);
    FHSSuseDualBand = ModParams->radio_type == RADIO_TYPE_LR1121_LORA_DUAL;

  Radio.Config(ModParams->bw, ModParams->sf, ModParams->cr, FHSSgetInitialFreq(),
               ModParams->PreambleLen, invertIQ, ModParams->PayloadLength, ModParams->interval
#if defined(RADIO_SX128X)
               , uidMacSeedGet(), OtaCrcInitializer, (ModParams->radio_type == RADIO_TYPE_SX128x_FLRC)
#endif
#if defined(RADIO_LR1121)
               , (ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_900 || ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_2G4), (uint8_t)UID[5], (uint8_t)UID[4]
#endif
               );

#if defined(RADIO_LR1121)
  if (FHSSuseDualBand)
  {
    Radio.Config(ModParams->bw2, ModParams->sf2, ModParams->cr2, FHSSgetInitialGeminiFreq(),
                ModParams->PreambleLen2, invertIQ, ModParams->PayloadLength, ModParams->interval,
                (ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_900 || ModParams->radio_type == RADIO_TYPE_LR1121_GFSK_2G4),
                (uint8_t)UID[5], (uint8_t)UID[4], SX12XX_Radio_2);
  }
#endif

    Radio.FuzzySNRThreshold = (RFperf->DynpowerSnrThreshUp == DYNPOWER_SNR_THRESH_NONE) ? 0 : (RFperf->DynpowerSnrThreshUp - RFperf->DynpowerSnrThreshDn);

    // if ((isDualRadio() && config.GetAntennaMode() == TX_RADIO_MODE_GEMINI) || FHSSuseDualBand) // Gemini mode
    // {
    //     Radio.SetFrequencyReg(FHSSgetInitialGeminiFreq(), SX12XX_Radio_2);
    // }

    // InitialFreq has been set, so lets also reset the FHSS Idx and Nonce.
    FHSSsetCurrIndex(0);
    OtaNonce = 0;

    OtaUpdateSerializers(smWideOr8ch, ModParams->PayloadLength);
    // OtaUpdateSerializers(newSwitchMode, ModParams->PayloadLength);
    MspSender.setMaxPackageIndex(31);
    // MspSender.setMaxPackageIndex(ELRS_MSP_MAX_PACKAGES);
    TelemetryReceiver.setMaxPackageIndex(OtaIsFullRes ? ELRS8_TELEMETRY_MAX_PACKAGES : ELRS4_TELEMETRY_MAX_PACKAGES);

    ExpressLRS_currAirRate_Modparams = ModParams;
    ExpressLRS_currAirRate_RFperfParams = RFperf;
    // CRSF::LinkStatistics.rf_Mode = ModParams->enum_rate;

    // handset->setPacketInterval(interval * ExpressLRS_currAirRate_Modparams->numOfSends);
    connectionState = disconnected;
    rfModeLastChangedMS = millis();
}

void ICACHE_RAM_ATTR HandleFHSS() // ELRS移植，注释源码另起修改
{
  uint8_t modresult = (OtaNonce + 1) % ExpressLRS_currAirRate_Modparams->FHSShopInterval;
  // If the next packet should be on the next FHSS frequency, do the hop
  if (!InBindingMode && modresult == 0)
  {
    // // Gemini mode
    // // If using DualBand always set the correct frequency band to the radios.  The HighFreq/LowFreq Tx amp is set during config.
    // if ((isDualRadio() && config.GetAntennaMode() == TX_RADIO_MODE_GEMINI) || FHSSuseDualBand)
    // {
    //     // Optimises the SPI traffic order.
    //     if (Radio.GetProcessingPacketRadio() == SX12XX_Radio_1)
    //     {
    //         uint32_t freqRadio = FHSSgetNextFreq();
    //         Radio.SetFrequencyReg(FHSSgetGeminiFreq(), SX12XX_Radio_2);
    //         Radio.SetFrequencyReg(freqRadio, SX12XX_Radio_1);
    //     }
    //     else
    //     {
    //         Radio.SetFrequencyReg(FHSSgetNextFreq(), SX12XX_Radio_1);
    //         Radio.SetFrequencyReg(FHSSgetGeminiFreq(), SX12XX_Radio_2);
    //     }
    // }
    // else
    {
      Radio.SetFrequencyReg(FHSSgetNextFreq());
    }
  }
}

void ICACHE_RAM_ATTR HandlePrepareForTLM() // ELRS移植，注释源码另起修改
{
  // If TLM enabled and next packet is going to be telemetry, start listening to have a large receive window (time-wise)
  if (ExpressLRS_currTlmDenom != 1 && ((OtaNonce + 1) % ExpressLRS_currTlmDenom) == 0)
  {
    Radio.RXnb();
    TelemetryRcvPhase = ttrpPreReceiveGap;
  }
}

void ICACHE_RAM_ATTR SendRCdataToRF() // ELRS移植，注释源码另起修改
{
  // // Do not send a stale channels packet to the RX if one has not been received from the handset
  // // *Do* send data if a packet has never been received from handset and the timer is running
  // // this is the case when bench testing and TXing without a handset
  // bool dontSendChannelData = false;
  // uint32_t lastRcData = handset->GetRCdataLastRecv();
  // if (lastRcData && (micros() - lastRcData > 1000000))
  // {
  //   // The tx is in Mavlink mode and without a valid crsf or RC input.  Do not send stale or fake zero packet RC!
  //   // Only send sync and MSP packets.
  //   if (config.GetLinkMode() == TX_MAVLINK_MODE)
  //   {
  //     dontSendChannelData = true;
  //   }
  //   else
  //   {
  //     return;
  //   }
  // }

  busyTransmitting = true;

  // uint32_t const now = millis();
  // ESP requires word aligned buffer
  WORD_ALIGNED_ATTR OTA_Packet_s otaPkt = {0};
//   static uint8_t syncSlot;
//
//   const bool isTlmDisarmed = config.GetTlm() == TLM_RATIO_DISARMED;
//   uint32_t SyncInterval = (connectionState == connected && !isTlmDisarmed) ? ExpressLRS_currAirRate_RFperfParams->SyncPktIntervalConnected : ExpressLRS_currAirRate_RFperfParams->SyncPktIntervalDisconnected;
//   bool skipSync = InBindingMode ||
//     // TLM_RATIO_DISARMED keeps sending sync packets even when armed until the RX stops sending telemetry and the TLM=Off has taken effect
//     (isTlmDisarmed && handset->IsArmed() && (ExpressLRS_currTlmDenom == 1));
//
  uint8_t NonceFHSSresult = OtaNonce % ExpressLRS_currAirRate_Modparams->FHSShopInterval;

  // Sync spam only happens on slot 1 and 2 and can't be disabled
  if (!InBindingMode && FHSSonSyncChannel())
  // if ((syncSpamCounter || (syncSpamCounterAfterRateChange && FHSSonSyncChannel())) && (NonceFHSSresult == 1 || NonceFHSSresult == 2))
  {
    otaPkt.std.type = PACKET_TYPE_SYNC;
    GenerateSyncPacketData(OtaIsFullRes ? &otaPkt.full.sync.sync : &otaPkt.std.sync);
    // syncSlot = 0; // reset the sync slot in case the new rate (after the syncspam) has a lower FHSShopInterval
  }
  // // Regular sync rotates through 4x slots, twice on each slot, and telemetry pushes it to the next slot up
  // // But only on the sync FHSS channel and with a timed delay between them
  // else if ((!skipSync) && ((syncSlot / 2) <= NonceFHSSresult) && (now - SyncPacketLastSent > SyncInterval) && FHSSonSyncChannel())
  // {
  //   otaPkt.std.type = PACKET_TYPE_SYNC;
  //   GenerateSyncPacketData(OtaIsFullRes ? &otaPkt.full.sync.sync : &otaPkt.std.sync);
  //   syncSlot = (syncSlot + 1) % (ExpressLRS_currAirRate_Modparams->FHSShopInterval * 2);
  // }
  else
  {
    if(isAirPort && apInputBuffer.size())
    {
      OtaPackAirportData(&otaPkt, &apInputBuffer);
    }
    else if (MspSender.IsActive())
    // if ((NextPacketIsMspData && MspSender.IsActive()) || dontSendChannelData)
    {
      otaPkt.std.type = PACKET_TYPE_MSPDATA;
      if (OtaIsFullRes)
      {
        otaPkt.full.msp_ul.packageIndex = MspSender.GetCurrentPayload(
          otaPkt.full.msp_ul.payload,
          sizeof(otaPkt.full.msp_ul.payload));
        // if (config.GetLinkMode() == TX_MAVLINK_MODE)
          otaPkt.full.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      }
      // else
      // {
      //   otaPkt.std.msp_ul.packageIndex = MspSender.GetCurrentPayload(
      //     otaPkt.std.msp_ul.payload,
      //     sizeof(otaPkt.std.msp_ul.payload));
      //   if (config.GetLinkMode() == TX_MAVLINK_MODE)
      //     otaPkt.std.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      // }
      validSendCount++;
      // // send channel data next so the channel messages also get sent during msp transmissions
      // NextPacketIsMspData = false;
      // counter can be increased even for normal msp messages since it's reset if a real bind message should be sent
      BindingSendCount++;
      // // If the telemetry ratio isn't already 1:2, send a sync packet to boost it
      // // to add bandwidth for the reply
      // if (ExpressLRS_currTlmDenom != 2)
      //   syncSpamCounter = 1;
    }
    else
    {
      // // always enable msp after a channel package since the slot is only used if MspSender has data to send
      // NextPacketIsMspData = true;
      otaPkt.std.type = PACKET_TYPE_MSPDATA;
      otaPkt.full.msp_ul.tlmFlag = TelemetryReceiver.GetCurrentConfirm();
      // injectBackpackPanTiltRollData(now);
      // OtaPackChannelData(&otaPkt, ChannelData, TelemetryReceiver.GetCurrentConfirm(), ExpressLRS_currTlmDenom);
    }
  }

  ///// Next, Calculate the CRC and put it into the buffer /////
  OtaGeneratePacketCrc(&otaPkt);

