AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
  if(OtaIsFullRes)
    CRCvalue = otaPkt.full.crc;
  else 
    CRCvalue = otaPkt.std.crcLow | otaPkt.std.crcHigh;
    
  SX12XX_Radio_Number_t transmittingRadio = Radio.GetLastSuccessfulPacketRadio();

  // if (isDualRadio())
  // {
  //   switch (config.GetAntennaMode())
  //   {
  //   case TX_RADIO_MODE_GEMINI:
  //     transmittingRadio = SX12XX_Radio_All; // Gemini mode
  //     break;
  //   case TX_RADIO_MODE_ANT_1:
  //     transmittingRadio = SX12XX_Radio_1; // Single antenna tx and true diversity rx for tlm receiption.
  //     break;
  //   case TX_RADIO_MODE_ANT_2:
  //     transmittingRadio = SX12XX_Radio_2; // Single antenna tx and true diversity rx for tlm receiption.
  //     break;
  //   case TX_RADIO_MODE_SWITCH:
  //     if(OtaNonce%2==0)   transmittingRadio = SX12XX_Radio_1; // Single antenna tx and true diversity rx for tlm receiption.
  //     else   transmittingRadio = SX12XX_Radio_2; // Single antenna tx and true diversity rx for tlm receiption.
  //     break;
  //   default:
  //     break;
  //   }
  // }

#if defined(Regulatory_Domain_EU_CE_2400)
  transmittingRadio &= ChannelIsClear(transmittingRadio);   // weed out the radio(s) if channel in use

  if (transmittingRadio == SX12XX_Radio_NONE)
  {
    // No packet will be sent due to LBT.
    // Defer TXdoneCallback() to prepare for TLM when the IRQ is normally triggered.
    deferExecutionMicros(ExpressLRS_currAirRate_RFperfParams->TOA, Radio.TXdoneCallback);
  }
  else
#endif
  {
    Radio.TXnb((uint8_t*)&otaPkt, ExpressLRS_currAirRate_Modparams->PayloadLength, transmittingRadio);
  }
}

void ICACHE_RAM_ATTR HWtimerCallbackTock() // ELRS移植，注释源码另起修改
{
  // /* If we are busy writing to EEPROM (committing config changes) then we just advance the nonces, i.e. no SPI traffic */
  // if (commitInProgress)
  // {
  //   nonceAdvance();
  //   return;
  // }

  // Radio.isFirstRxIrq = true;

  // // Sync OpenTX to this point
  // if (!(OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends))
  // {
  //   handset->JustSentRFpacket();
  // }

  // // Do not transmit or advance FHSS/Nonce until in disconnected/connected state
  // if (connectionState == awaitingModelId)
  //   return;

  // // Tx Antenna Diversity
  // if ((OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends == 0 || // Swicth with new packet data
  //     OtaNonce % ExpressLRS_currAirRate_Modparams->numOfSends == ExpressLRS_currAirRate_Modparams->numOfSends / 2) && // Swicth in the middle of DVDA sends
  //     TelemetryRcvPhase == ttrpTransmitting) // Only switch when transmitting.  A diversity rx will send tlm back on the best antenna.  So dont switch away from it.
  // {
  //   switchDiversityAntennas();
  // }

  // Nonce advances on every timer tick
  if (!InBindingMode)
    OtaNonce++;

  // If HandleTLM has started Receive mode, TLM packet reception should begin shortly
  // Skip transmitting on this slot
  if (TelemetryRcvPhase == ttrpPreReceiveGap)
  {
    TelemetryRcvPhase = ttrpExpectingTelem;
#if defined(Regulatory_Domain_EU_CE_2400)
    // Use downlink LQ for LBT success ratio instead for EU/CE reg domain
    CRSF::LinkStatistics.downlink_Link_quality = LBTSuccessCalc.getLQ();
#else
    // CRSF::LinkStatistics.downlink_Link_quality = LQCalc.getLQ();
#endif
    LQCalc.inc();
    return;
  }
  // else if (TelemetryRcvPhase == ttrpExpectingTelem && !LQCalc.currentIsSet())
  // {
  //   // // Indicate no telemetry packet received to the DP system
  //   // DynamicPower_TelemetryUpdate(DYNPOWER_UPDATE_MISSED);
  // }

  TelemetryRcvPhase = ttrpTransmitting;

  SendRCdataToRF();
}

bool ICACHE_RAM_ATTR RXdoneISR(SX12xxDriverCommon::rx_status const status) // ELRS移植，注释源码另起修改
{
  fullRcount++;

  if (LQCalc.currentIsSet())
  {
    return false; // Already received tlm, do not run ProcessTLMpacket() again.
  }

  bool packetSuccessful = ProcessTLMpacket(status);
#if defined(Regulatory_Domain_EU_CE_2400)
  if (packetSuccessful)
  {
    SetClearChannelAssessmentTime();
  }
#endif
  busyTransmitting = false;
  return packetSuccessful;
}

void ICACHE_RAM_ATTR TXdoneISR() // ELRS移植，注释源码另起修改
{
  if (!busyTransmitting)
  {
    return; // Already finished transmission and do not call HandleFHSS() a second time, which may hop the frequency!
  }
  fullScount++;
  if (connectionState != awaitingModelId)
  {
    HandleFHSS();
    HandlePrepareForTLM();
#if defined(Regulatory_Domain_EU_CE_2400)
    if (TelemetryRcvPhase != ttrpPreReceiveGap)
    {
      // Start RX for Listen Before Talk early because it takes about 100us
      // from RX enable to valid instant RSSI values are returned.
      // If rx was already started by TLM prepare above, this call will let RX
      // continue as normal.
      SetClearChannelAssessmentTime();
    }
#endif // non-CE
  }
  busyTransmitting = false;
}

static void UpdateConnectDisconnectStatus() // ELRS移植，注释源码另起修改
{
  // Number of telemetry packets which can be lost in a row before going to disconnected state
  constexpr unsigned RX_LOSS_CNT = 5;
  // Must be at least 512ms and +2 to account for any rounding down and partial millis()
  const uint32_t msConnectionLostTimeout = std::max((uint32_t)512U,
    (uint32_t)ExpressLRS_currTlmDenom * ExpressLRS_currAirRate_Modparams->interval / (1000U / RX_LOSS_CNT)
    ) + 2U;
  // Capture the last before now so it will always be <= now
  const uint32_t lastTlmMillis = LastTLMpacketRecvMillis;
  const uint32_t now = millis();
  if (lastTlmMillis && ((now - lastTlmMillis) <= msConnectionLostTimeout))
  {
    if (connectionState != connected)
    {
      connectionState = connected;
      // CRSFHandset::ForwardDevicePings = true;
      Serial.println("got downlink conn");
      // DBGLN("got downlink conn");

      apInputBuffer.flush();
      apOutputBuffer.flush();
      // uartInputBuffer.flush();

      // VtxTriggerSend();
    }
  }
  // If past RX_LOSS_CNT, or in awaitingModelId state for longer than DisconnectTimeoutMs, go to disconnected
  else if (connectionState == connected ||
    (now - rfModeLastChangedMS) > ExpressLRS_currAirRate_RFperfParams->DisconnectTimeoutMs)
  {
    connectionState = disconnected;
    // connectionHasModelMatch = true;
    // CRSFHandset::ForwardDevicePings = false;
  }
}

void SendUIDOverMSP() // ELRS移植，注释源码另起修改
{
  MSPDataPackage[0] = MSP_ELRS_BIND;
  memcpy(&MSPDataPackage[1], &UID[2], 4);
  BindingSendCount = 0;
  MspSender.ResetState();
  MspSender.SetDataToTransmit(MSPDataPackage, 5);
}

static void EnterBindingMode() // ELRS移植，注释源码另起修改
{
  if (InBindingMode)
    return;

  // Disable the TX timer and wait for any TX to complete
  hwTimer::stop();
  // while (busyTransmitting);

  // Queue up sending the Master UID as MSP packets
  SendUIDOverMSP();

  // Binding uses a CRCInit=0, 50Hz, and InvertIQ
  OtaCrcInitializer = 0;
  OtaNonce = 0; // Lock the OtaNonce to prevent syncspam packets
  InBindingMode = true; // Set binding mode before SetRFLinkRate() for correct IQ

  // Start attempting to bind
  // Lock the RF rate and freq while binding
  SetRFLinkRate(enumRatetoIndex(RATE_BINDING));

