AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
  // Start transmitting again
  hwTimer::resume();
  
  Serial.println("Entered binding mode at freq = " + String(Radio.currFreq));
  // DBGLN("Entered binding mode at freq = %d", Radio.currFreq);
}

static void ExitBindingMode() // ELRS移植，注释源码另起修改
{
  if (!InBindingMode)
    return;

  MspSender.ResetState();

  // Reset CRCInit to UID-defined value
  OtaUpdateCrcInitFromUid();
  InBindingMode = false; // Clear binding mode before SetRFLinkRate() for correct IQ

  SetRFLinkRate(enumRatetoIndex(AIRRATE)); //return to original rate
  // SetRFLinkRate(config.GetRate()); 

  Serial.println("Exiting binding mode");
  // DBGLN("Exiting binding mode");
}

static void HandleUARTout() // ELRS移植，注释源码另起修改
{
  if(Serial.availableForWrite())
  // if (firmwareOptions.is_airport)
  {
    auto size = apOutputBuffer.size();
    if (size)
    {
      uint8_t buf[size];
      apOutputBuffer.lock();
      apOutputBuffer.popBytes(buf, size);
      apOutputBuffer.unlock();
      Serial.write(buf, size);
      // TxUSB->write(buf, size);
    }
  }
}

static void HandleUARTin() // ELRS移植，注释源码另起修改
{
  if(Serial.available())
  { 
    auto size = std::min(apInputBuffer.free(), (uint16_t)Serial.available());
    if (size > 0)
    {
      uint8_t buf[size];
      Serial.readBytes(buf, size);
      apInputBuffer.lock();
      apInputBuffer.pushBytes(buf, size);
      apInputBuffer.unlock();
    }
  }
  //   // Read from the USB serial port
  // if (TxUSB->available())
  // {
  //   if (firmwareOptions.is_airport)
  //   {
  //     auto size = std::min(apInputBuffer.free(), (uint16_t)TxUSB->available());
  //     if (size > 0)
  //     {
  //       uint8_t buf[size];
  //       TxUSB->readBytes(buf, size);
  //       apInputBuffer.lock();
  //       apInputBuffer.pushBytes(buf, size);
  //       apInputBuffer.unlock();
  //     }
  //   }
  //   else
  //   {
  //     auto size = std::min(uartInputBuffer.free(), (uint16_t)TxUSB->available());
  //     if (size > 0)
  //     {
  //       uint8_t buf[size];
  //       TxUSB->readBytes(buf, size);
  //       uartInputBuffer.lock();
  //       uartInputBuffer.pushBytes(buf, size);
  //       uartInputBuffer.unlock();

  //       // Lets check if the data is Mav and auto change LinkMode
  //       // Start the hwTimer since the user might be operating the module as a standalone unit without a handset.
  //       if (connectionState == noCrossfire)
  //       {
  //         if (isThisAMavPacket(buf, size))
  //         {
  //           config.SetLinkMode(TX_MAVLINK_MODE);
  //           UARTconnected();
  //         }
  //       }
  //     }
  //   }
  // }

  // // Read from the Backpack serial port
  // if (TxBackpack->available())
  // {
  //   auto size = std::min(uartInputBuffer.free(), (uint16_t)TxBackpack->available());
  //   if (size > 0)
  //   {
  //     uint8_t buf[size];
  //     TxBackpack->readBytes(buf, size);

  //     // If the TX is in Mavlink mode, push the bytes into the fifo buffer
  //     if (config.GetLinkMode() == TX_MAVLINK_MODE)
  //     {
  //       uartInputBuffer.lock();
  //       uartInputBuffer.pushBytes(buf, size);
  //       uartInputBuffer.unlock();

  //       // The tx is in Mavlink mode and receiving data from the Backpack.
  //       // Start the hwTimer since the user might be operating the module as a standalone unit without a handset.
  //       if (connectionState == noCrossfire)
  //       {
  //         if (isThisAMavPacket(buf, size))
  //         {
  //           UARTconnected();
  //         }
  //       }
  //     }

  //     // Try to parse any MSP packets from the Backpack
  //     ParseMSPData(buf, size);
  //   }
  // }
}

static void setupBindingFromConfig() // ELRS移植，注释源码另起修改
{
  // if (firmwareOptions.hasUID)
  // {
  //     memcpy(UID, firmwareOptions.uid, UID_LEN);
  // }
  // else
  {
#ifdef PLATFORM_ESP32
    esp_read_mac(UID, ESP_MAC_WIFI_STA);
#elif PLATFORM_STM32
    UID[0] = (uint8_t)HAL_GetUIDw0();
    UID[1] = (uint8_t)(HAL_GetUIDw0() >> 8);
    UID[2] = (uint8_t)HAL_GetUIDw1();
    UID[3] = (uint8_t)(HAL_GetUIDw1() >> 8);
    UID[4] = (uint8_t)HAL_GetUIDw2();
    UID[5] = (uint8_t)(HAL_GetUIDw2() >> 8);
#endif
  }

    Serial.print("UID ");
    for (int i = 0; i < sizeof(UID); i++)
      Serial.print(String(UID[i]) + " ");
    Serial.println();
  // DBGLN("UID=(%d, %d, %d, %d, %d, %d)",
  //   UID[0], UID[1], UID[2], UID[3], UID[4], UID[5]);

  OtaUpdateCrcInitFromUid();
}

/* User Function */

void displayDebugInfo()
{
    display.clearDisplay();
    if (InBindingMode)
    {
        display.setCursor(0, 0);
        display.println("sending UID...");
    }
    else
    {
        // UID
        display.setCursor(0, 0);
        display.println("ID");
        display.setCursor(18, 0);
        display.println(UID[2]);
        display.setCursor(42, 0);
        display.println(UID[3]);
        display.setCursor(66, 0);
        display.println(UID[4]);
        display.setCursor(90, 0);
        display.println(UID[5]);
        // send freq
        display.setCursor(0, 16);
        display.println("Send");
        display.setCursor(30, 16);
        display.println(validSendFreq);
        // full Send freq
        display.setCursor(54, 16);
        display.println("FullS");
        display.setCursor(92, 16);
        display.println(fullSfreq); 
        // receive freq
        display.setCursor(0, 24);
        display.println("Recv");
        display.setCursor(30, 24);
        display.println(validReceiveFreq);  
        // // full Recv freq
        // display.setCursor(54, 24);
        // display.println("FullR");
        // display.setCursor(92, 24);
        // display.println(fullRfreq);
        display.setCursor(54, 24);     
        display.println("RSSI");     
        display.setCursor(84, 24);           
        display.println(Radio.GetRssiInst(SX12XX_Radio_All)); 
    }
    // Freq
    display.setCursor(0, 8);
    display.println("FQ");
    display.setCursor(18, 8);
    display.println(Radio.currFreq);
    // Channel
    display.setCursor(76, 8);
    display.println("CH");
    display.setCursor(94, 8);
    display.println(FHSSgetCurrIndex());
    display.display();
}

