AYCXJY/STM32F103C8T6-SX1281/src/tx_main.cpp
void handleButtonPress(void)
{
    delay(25);
    if (digitalRead(PB1) == 0)
    {
        while (digitalRead(PB1) == 0)
            ;
        delay(25);
        EnterBindingMode();
    }

}

void TimerHandler()
{
  static uint16_t timercount = 0;
  if(timercount % (1000000 / TIMER_INTERVAL_MS) == 0)
  {
    validSendFreq = validSendCount;
    validSendCount = 0;
    validReceiveFreq = validReceiveCount;
    validReceiveCount = 0;
    fullSfreq = fullScount;
    fullScount = 0;
    fullRfreq = fullRcount;
    fullRcount = 0;

    // uint8_t buf[140] = {"HELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOWORLDHELLOW\r\n"};
    // apInputBuffer.pushBytes(buf, sizeof(buf));
  }
  timercount++;

  if(connectionState == connected)
  {
    digitalWrite(PC13, LOW);
  }
  else
  {
    digitalToggle(PC13);
  }
}

void setupBasicHardWare(void)
{
    // UART
    Serial.begin(BUADRATE);
    // LED
    pinMode(PC13, OUTPUT);
    digitalWrite(PC13, HIGH);
    // Button
    pinMode(PB1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PB1), handleButtonPress, FALLING);
    // OLED
    Wire.setSCL(PB8);
    Wire.setSDA(PB9);
    Wire.begin();
    display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.clearDisplay();
    display.display();
    // sx1280 GPIO
    pinMode(GPIO_PIN_TX_EN, OUTPUT);
    pinMode(GPIO_PIN_RX_EN, OUTPUT);
    // TIM2
    ITimer.attachInterruptInterval(TIMER_INTERVAL_MS, TimerHandler);
}


/* setup and loop */

void setup()
{
  setupBasicHardWare();

  setupBindingFromConfig();
  FHSSrandomiseFHSSsequence(uidMacSeedGet());

  Radio.TXdoneCallback = &TXdoneISR;
  Radio.RXdoneCallback = &RXdoneISR;

  Radio.currFreq = FHSSgetInitialFreq();

  Radio.Begin(FHSSgetMinimumFreq(), FHSSgetMaximumFreq());

  TelemetryReceiver.SetDataToReceive(StubbornReceiverBuffer, sizeof(StubbornReceiverBuffer));
  // TelemetryReceiver.SetDataToReceive(CRSFinBuffer, sizeof(CRSFinBuffer));

  SetRFLinkRate(enumRatetoIndex(AIRRATE));

  hwTimer::init(nullptr, HWtimerCallbackTock);
  hwTimer::resume();

  ExpressLRS_currTlmDenom = 2;

  Radio.SetOutputPower(SX1280_POWER_MAX);
}

void loop()
{
  uint32_t now = millis();

  // displayDebugInfo();

  HandleUARTout();

  HandleUARTin();

  if (connectionState < MODE_STATES)
  {
    UpdateConnectDisconnectStatus();
  }
  
  // only send msp data when binding is not active
  static bool mspTransferActive = false;

  if (TelemetryReceiver.HasFinishedData())
  {
      apOutputBuffer.lock();
      apOutputBuffer.atomicPushBytes(StubbornReceiverBuffer, PACKETSIZE);
      apOutputBuffer.unlock();
      TelemetryReceiver.Unlock();
  }
  if (InBindingMode)
  {
    // exit bind mode if package after some repeats
    if (BindingSendCount > BindingSpamAmount) 
    {
      ExitBindingMode();
    }
  }
  else if (!MspSender.IsActive())
  {
    auto size = apInputBuffer.size();
    if (size >= PACKETSIZE)
    {
      apInputBuffer.lock();
      apInputBuffer.popBytes(StubbornSenderBuffer, PACKETSIZE);
      apInputBuffer.unlock();
      MspSender.SetDataToTransmit(StubbornSenderBuffer, PACKETSIZE);
    }
  }
}
